Repository: Haddi234/EECE455-Project
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: ar, fr

source: Invalid username or password
ar: اسم المستخدم أو كلمة المرور غير صحيحة
fr: Nom d'utilisateur ou mot de passe invalide

source: Unauthorized: Please log in first
ar: غير مصرح: يرجى تسجيل الدخول أولاً
fr: Non autorisé : Veuillez vous connecter d'abord

source: Binary coefficients must be a single digit: 0 or 1.
ar: يجب أن تكون المعاملات الثنائية رقمًا واحدًا فقط: 0 أو 1.
fr: Les coefficients binaires doivent être un seul chiffre : 0 ou 1.

source: Hexadecimal coefficients must only contain characters 0-9 and A-F.
ar: يجب أن تحتوي المعاملات السداسية عشرية على الأحرف من 0 إلى 9 و A-F فقط.
fr: Les coefficients hexadécimaux doivent contenir uniquement les caractères 0-9 et A-F.

source: Decimal coefficients must only contain digits 0-9.
ar: يجب أن تحتوي المعاملات العشرية على أرقام من 0 إلى 9 فقط.
fr: Les coefficients décimaux doivent contenir uniquement des chiffres de 0 à 9.

source: Invalid coefficient format specified.
ar: تم تحديد تنسيق معامل غير صالح.
fr: Format de coefficient spécifié invalide.

source: Division by zero is not allowed
ar: القسمة على صفر غير مسموح بها
fr: La division par zéro n'est pas autorisée

source: Zero has no multiplicative inverse
ar: الصفر ليس له معكوس ضرب
fr: Le zéro n'a pas d'inverse multiplicatif

source: Invalid operation
ar: عملية غير صالحة
fr: Opération invalide

source: Please log in or sign up to view history
ar: يرجى تسجيل الدخول أو الاشتراك لعرض السجل
fr: Veuillez vous connecter ou vous inscrire pour voir l'historique

source: Guests cannot access history. Please log in or sign up.
ar: الضيوف لا يمكنهم الوصول إلى السجل. يرجى تسجيل الدخول أو الاشتراك.
fr: Les invités ne peuvent pas accéder à l'historique. Veuillez vous connecter ou vous inscrire.

source: This is where history would be
ar: هنا سيكون السجل
fr: C'est ici que l'historique apparaîtra

source: Polynomial Arithmetic
ar: الحساب المتعدد الحدود
fr: Arithmétique polynomiale

source: History
ar: السجل
fr: Historique

source: Login/Signup
ar: تسجيل الدخول/الاشتراك
fr: Connexion/Inscription

source: Logout
ar: تسجيل الخروج
fr: Déconnexion

source: About
ar: حول
fr: À propos

source: Settings
ar: الإعدادات
fr: Paramètres

source: Language Selection
ar: اختيار اللغة
fr: Sélection de la langue

source: Dark Mode: Off
ar: الوضع الداكن: إيقاف
fr: Mode sombre : Désactivé

source: Access Denied
ar: تم الرفض
fr: Accès refusé

source: You need to log in or sign up to perform this action.
ar: يجب عليك تسجيل الدخول أو الاشتراك للقيام بهذا الإجراء.
fr: Vous devez vous connecter ou vous inscrire pour effectuer cette action.

source: GF(2^m) Arithmetic Calculator
ar: آلة حاسبة للحساب GF(2^m)
fr: Calculatrice arithmétique GF(2^m)

source: Field Degree (m):
ar: درجة الحقل (m):
fr: Degré du champ (m) :

source: Polynomial Degree:
ar: درجة الحدود المتعددة:
fr: Degré du polynôme :

source: Coefficient Format:
ar: تنسيق المعامل:
fr: Format du coefficient :

source: Binary
ar: ثنائي
fr: Binaire

source: Hexadecimal
ar: سداسي عشري
fr: Hexadécimal

source: Decimal
ar: عشري
fr: Décimal

source: Select Operation:
ar: اختر العملية:
fr: Sélectionnez l'opération :

source: Addition
ar: جمع

source: Subtraction
ar: طرح
fr: Soustraction

source: Multiplication
ar: ضرب

source: Division
ar: قسمة

source: Inverse
ar: معكوس

source: Output Format:
ar: تنسيق الإخراج:
fr: Format de sortie :

source: Polynomial
ar: متعدد الحدود
fr: Polynôme

source: Perform Operation
ar: تنفيذ العملية
fr: Effectuer l'opération

source: Enter Coefficients for Polynomial A:
ar: أدخل المعاملات للحد A:
fr: Entrez les coefficients pour le polynôme A :

source: Enter Coefficients for Polynomial B:
ar: أدخل المعاملات للحد B:
fr: Entrez les coefficients pour le polynôme B :

source: Dark Mode: On
ar: الوضع الداكن: تشغيل
fr: Mode sombre : Activé
